// pages/payNotice/payNotice.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, {
        title: '水电欠费通知',
        content: "您于2019-08-21欠电费300元，水费50元，请尽快缴清，以免给您带来不必要的困扰，谢谢合作。"
      }, 
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})